package main

import (
	"fmt"
)

/*
给你一个正整数数组 nums ，对 nums 所有元素求积之后，找出并返回乘积中 不同质因数 的数目。

注意：

质数 是指大于 1 且仅能被 1 及自身整除的数字。
如果 val2 / val1 是一个整数，则整数 val1 是另一个整数 val2 的一个因数。

示例 1：

输入：nums = [2,4,3,7,10,6]
输出：4
解释：
nums 中所有元素的乘积是：2 * 4 * 3 * 7 * 10 * 6 = 10080 = 25 * 32 * 5 * 7 。
共有 4 个不同的质因数，所以返回 4 。
示例 2：

输入：nums = [2,4,8,16]
输出：1
解释：
nums 中所有元素的乘积是：2 * 4 * 8 * 16 = 1024 = 210 。
共有 1 个不同的质因数，所以返回 1 。

提示：

- 1 <= nums.length <= 10^4
- 2 <= nums[i] <= 1000
*/
func main() {
	ps := getPrimes(1000)
	for _, p := range ps {
		fmt.Print(p, ", ")
	}
	fmt.Println()
	fmt.Println("distinctPrimeFactors([]int{2,4,3,7,10,6}) = ", distinctPrimeFactors([]int{2, 4, 3, 7, 10, 6}))
}

func distinctPrimeFactors(nums []int) int {
	primes := []int{2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97, 101, 103, 107, 109, 113, 127, 131, 137, 139, 149, 151, 157, 163, 167, 173, 179, 181, 191, 193, 197, 199, 211, 223, 227, 229, 233, 239, 241, 251, 257, 263, 269, 271, 277, 281, 283, 293, 307, 311, 313, 317, 331, 337, 347, 349, 353, 359, 367, 373, 379, 383, 389, 397, 401, 409, 419, 421, 431, 433, 439, 443, 449, 457, 461, 463, 467, 479, 487, 491, 499, 503, 509, 521, 523, 541, 547, 557, 563, 569, 571, 577, 587, 593, 599, 601, 607, 613, 617, 619, 631, 641, 643, 647, 653, 659, 661, 673, 677, 683, 691, 701, 709, 719, 727, 733, 739, 743, 751, 757, 761, 769, 773, 787, 797, 809, 811, 821, 823, 827, 829, 839, 853, 857, 859, 863, 877, 881, 883, 887, 907, 911, 919, 929, 937, 941, 947, 953, 967, 971, 977, 983, 991, 997}
	result := 0
	pms := map[int]struct{}{}
	for _, num := range nums {
		for _, prime := range primes {
			if prime > num {
				break
			}
			if num%prime == 0 {
				if _, ok := pms[prime]; !ok {
					pms[prime] = struct{}{}
					result++
				}
			}
		}
	}
	return result
}

func getPrimes(maxp int) []int {
	var result []int
	for i := 2; i <= maxp; i++ {
		zhi := true
		for x := 2; x < i; x++ {
			if i%x == 0 {
				zhi = false
				break
			}
		}
		if zhi {
			result = append(result, i)
		}
	}
	return result
}
